#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.this will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "this" {
        id                                  = "/subscriptions/3cef72c9-b50b-422c-aff6-dd279b745d34/resourceGroups/SINGLE_AKS_MY_RG/providers/Microsoft.ContainerService/managedClusters/SINGLE_AKS"
        name                                = "SINGLE_AKS"
        tags                                = {}
        # (38 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - max_surge = "10%" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_mysql_flexible_server.ghost_db will be created
  + resource "azurerm_mysql_flexible_server" "ghost_db" {
      + administrator_login           = "ghost_admin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "northcentralus"
      + name                          = "ghost-db"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "SINGLE_AKS_MY_RG"
      + sku_name                      = "B_Standard_B1s"
      + version                       = "8.0.21"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @iscahomd, Action: `pull_request`, Workflow: `Terraform`*